arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
void ArticTransceiver::print_firmware_version()
{
    char version[9];
    memset(version, 0x00, sizeof(version));

    spi_read(PMEM, FIRMWARE_VERSION_ADDRESS, (uint8_t *) version, 8);
    version[8] = '\0';
    DEBUG_TRACE("ArticTransceiver::print_firmware_version: %s", version);
}

void ArticTransceiver::power_off()
{
    DEBUG_TRACE("ArticTransceiver::power_off");

	// Disable any RX processing
    m_irq_int[INTERRUPT_1]->disable();
    system_scheduler->cancel_task(m_rx_timeout_task);
	m_is_rx_enabled = false;

    m_deferred_task_stopped = true;

	GPIOPins::clear(BSP::GPIO::GPIO_SAT_RESET);
	GPIOPins::clear(BSP::GPIO::GPIO_SAT_EN);

	delete m_nrf_spim;
    m_nrf_spim = nullptr; // Invalidate this pointer so if we call this function again it doesn't call delete on an invalid pointer

    delete m_irq_int[0];
    m_irq_int[0] = nullptr;

	// FIXME: should this be moved into the NrfSPIM driver?
	nrf_gpio_cfg_output(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
	nrf_gpio_pin_clear(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.mosi_pin, NRF_GPIO_PIN_PULLDOWN);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.miso_pin, NRF_GPIO_PIN_PULLDOWN);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.sck_pin, NRF_GPIO_PIN_PULLDOWN);

    // Mark device as powered off
    m_is_powered_on = false;
}

void ArticTransceiver::add_rx_packet_filter(const uint32_t address) {

	// Read current filter entry count
	uint32_t tmp = 0, lut_size = 0, value = 0;
    burst_access(XMEM, RX_FILTERING_CONFIG + 3, nullptr, (uint8_t *)&tmp, 3, true);
    reverse_memcpy((uint8_t *)&lut_size, (const uint8_t *)&tmp, 3);

    // Scan existing filter table to make sure the entry does not already exist
    for (unsigned int i = 0; i < lut_size; i++) {
    	uint32_t existing_addr = 0;

    	// Get 24 LSBs of address
        burst_access(XMEM, RX_FILTERING_CONFIG + 4 + (2*i), nullptr, (uint8_t *)&tmp, 3, true);
        reverse_memcpy((uint8_t *)&existing_addr, (const uint8_t *)&tmp, 3);

        // Get 4 MSBs of address
        burst_access(XMEM, RX_FILTERING_CONFIG + 5 + (2*i), nullptr, (uint8_t *)&tmp, 3, true);
        reverse_memcpy((uint8_t *)&value, (const uint8_t *)&tmp, 3);
        existing_addr |= (value & 0xF) << 24;

        // Don't add a new filter if it already exists in the table
        if (existing_addr == address) {
        	DEBUG_TRACE("ArticTransceiver::add_rx_packet_filter: address=%08x already in table", address);
        	return;
        }
    }

	DEBUG_TRACE("ArticTransceiver::add_rx_packet_filter: new address=%08x added", address);

    // Add new LUT entry to end of table (24 LSBs first)
    value = address & 0xFFFFFF;
    reverse_memcpy((uint8_t *)&tmp, (const uint8_t *)&value, 3);
    burst_access(XMEM, RX_FILTERING_CONFIG + 4 + (2*lut_size), (const uint8_t *)&tmp, nullptr, 3, false);

    // Add new LUT entry to end of table (4 MSBs last)
    value = (address >> 24) & 0xF;
    reverse_memcpy((uint8_t *)&tmp, (const uint8_t *)&value, 3);
    burst_access(XMEM, RX_FILTERING_CONFIG + 5 + (2*lut_size), (const uint8_t *)&tmp, nullptr, 3, false);

    // Increment the lut_size by 1 and write back to reflect new size
    lut_size++;
    reverse_memcpy((uint8_t *)&tmp, (const uint8_t *)&lut_size, 3);
    burst_access(XMEM, RX_FILTERING_CONFIG + 3, (const uint8_t *)&tmp, nullptr, 3, false);
}


ArticTransceiver::ArticTransceiver() {
    m_nrf_spim = nullptr;
    m_irq_int[0] = nullptr;
    m_irq_int[1] = nullptr;
	hardware_init();
}

bool ArticTransceiver::is_powered_on() {
    return m_is_powered_on;
}

bool ArticTransceiver::is_rx_enabled() {
    return m_is_rx_enabled;
}

void ArticTransceiver::power_on(std::function<void(ArgosAsyncEvent)> notification_callback)
{
    DEBUG_TRACE("ArticTransceiver::power_on");

    m_notification_callback = notification_callback;
    m_deferred_task_stopped = false;

    DEBUG_TRACE("ArticTransceiver::power_on: NrfSPIM()");

    if (!m_nrf_spim)
	    m_nrf_spim = new NrfSPIM(SPI_SATELLITE);

    DEBUG_TRACE("ArticTransceiver::power_on: NrfIRQ(0)");

    if (!m_irq_int[0])
    	m_irq_int[0] = new NrfIRQ(BSP::GPIO::GPIO_INT1_SAT);

    GPIOPins::set(BSP::GPIO::GPIO_SAT_EN);
    GPIOPins::set(BSP::GPIO::GPIO_SAT_RESET);

    // Mark the device as powered on
    m_is_powered_on = true;

    system_scheduler->post_task_prio([this](){
        // Reset the Artic device
        GPIOPins::clear(BSP::GPIO::GPIO_SAT_RESET);

        system_scheduler->post_task_prio([this](){
            // Exit reset
        	GPIOPins::set(BSP::GPIO::GPIO_SAT_RESET);
        	// Wait until programming firmware
            system_scheduler->post_task_prio([this](){
                program_firmware([this]() {
					print_firmware_version();
					m_is_first_tx = true;
					m_notification_callback(ArgosAsyncEvent::DEVICE_READY);
                });
            }, "FirmwareProgrammingDelay", Scheduler::DEFAULT_PRIORITY, SAT_ARTIC_DELAY_RESET_MS);
        }, "ArcticResetDelay", Scheduler::DEFAULT_PRIORITY, SAT_ARTIC_DELAY_RESET_MS);
    }, "ArcticPowerOnDelay", Scheduler::DEFAULT_PRIORITY, SAT_ARTIC_DELAY_POWER_ON_MS);
}

void ArticTransceiver::read_packet(ArgosPacket& packet, unsigned int& size) {
	packet = m_rx_packet;
	size = m_rx_packet_bits;
}

void ArticTransceiver::set_idle() {
	DEBUG_TRACE("ArticTransceiver::set_idle");

	// Disable any RX processing
    m_irq_int[INTERRUPT_1]->disable();
    system_scheduler->cancel_task(m_rx_timeout_task);
	m_is_rx_enabled = false;

    // Configure idle mode (this will also disable a
	send_command_check_clean(ARTIC_CMD_SLEEP, INTERRUPT_1, (1<<IDLE_STATE), SAT_ARTIC_DELAY_INTERRUPT_MS);
}

bool ArticTransceiver::buffer_rx_packet() {
	uint8_t buffer[MAX_RX_SIZE_BYTES];

	// Read the entire RX payload from X memory
	burst_access(XMEM, RX_PAYLOAD_ADDRESS, nullptr, buffer, MAX_RX_SIZE_BYTES, true);

	// First 24-bit is the packet size (MSB first)
	m_rx_packet_bits = buffer[0] << 16 |
			           buffer[1] << 8 |
					   buffer[2];

	// Make sure the size is valid and does not exceed the maximum allowed size
	if (m_rx_packet_bits >= (8 * MIN_RX_SIZE_BYTES) && m_rx_packet_bits <= (8 * (MAX_RX_SIZE_BYTES-3))) {
		// Assign payload to the locally stored RX buffer
		m_rx_packet.assign((const char *)&buffer[3], (m_rx_packet_bits + 7) / 8);
		DEBUG_TRACE("ArticTransceiver::buffer_rx_packet: data=%s", Binascii::hexlify(m_rx_packet).c_str());

		// Compute CRC16 on the payload
		unsigned int crc = CRC16::checksum(m_rx_packet, m_rx_packet_bits);
		if (crc != 0) {
			DEBUG_TRACE("ArticTransceiver::buffer_rx_packet: discarded packet owing to bad CRC");
			return false;
		}

