arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/artic_r2/artic.cpp
		return true;
	}

	DEBUG_TRACE("ArticTransceiver::buffer_rx_packet: discarded owing to illegal size %u bits", m_rx_packet_bits);

	// Invalid contents, clear current packet
	m_rx_packet_bits = 0;
	m_rx_packet.clear();

	return false;
}

void ArticTransceiver::set_rx_mode(const ArgosMode mode, const unsigned int timeout_ms) {

	DEBUG_TRACE("ArticTransceiver::set_rx_mode(%u,%u)", (unsigned int)mode, timeout_ms);

	if (m_is_rx_enabled)
		return;

	// Add new entries for filtering on new packet types added since the firmware
	// image was released
	add_rx_packet_filter(0x000005F); // Constellation Satellite Status - format B
	add_rx_packet_filter(0x00000D4); // Satellite Orbit Parameters – format B for ANGELS

	// Mark RX as enabled
	m_is_rx_enabled = true;

	// (Re-)Start RX_TIMEOUT in software
	system_scheduler->cancel_task(m_rx_timeout_task);
	m_rx_timeout_task = system_scheduler->post_task_prio([this]() {
		m_notification_callback(ArgosAsyncEvent::RX_TIMEOUT);
	}, "RXTimeoutTask", Scheduler::DEFAULT_PRIORITY, timeout_ms);

	// Send asynchronous command to configure RX mode and start continuous RX
	send_command_check_clean_async((mode == ArgosMode::ARGOS_3) ? ARTIC_CMD_SET_ARGOS_3_RX_MODE : ARTIC_CMD_SET_ARGOS_4_RX_MODE,
			INTERRUPT_1, (1<<MCU_COMMAND_ACCEPTED) | (1<<dsp2mcu_int1), SAT_ARTIC_DELAY_INTERRUPT_MS,
	[this]() {
		// Enable IRQ to inform us whenever a packet is available
	    m_irq_int[INTERRUPT_1]->enable([this]() {
	        DEBUG_TRACE("ArticTransceiver::set_rx_mode: IRQ set");

	        uint32_t status = 0;
	        get_status_register(&status);
	        print_status(status);

	        // Check for valid RX message
	        if (status & (1 << RX_VALID_MESSAGE)) {
	        	// Only notify if new RX packet has been stored
	        	if (buffer_rx_packet())
		        	m_notification_callback(ArgosAsyncEvent::RX_PACKET);
	        }

	        // Don't clear the interrupt until X memory has been read
	        // and the event has been processed to avoid reentry
	        clear_interrupt(INTERRUPT_1);
	    });

		// Configure RX continuous mode
	    send_command_check_clean(ARTIC_CMD_START_RX_CONT, NO_INTERRUPT, (1<<RX_IN_PROGRESS), SAT_ARTIC_DELAY_INTERRUPT_MS);
	});
}

void ArticTransceiver::send_packet(ArgosPacket const& user_payload, unsigned int argos_id, unsigned int payload_length, const ArgosMode mode)
{
	ArgosPacket packet;
	unsigned int total_bits;
	unsigned int stuffing_bits = 0;

	// Only A2/A3 mode is supported
	if ((payload_length + 8) & 31) {
		// Stuff zeros at the end to align to nearest boundary
		stuffing_bits = 32 - ((payload_length + 8) % 32);
		DEBUG_TRACE("ArticTransceiver::send_packet: adding %u stuffing bits for alignment", stuffing_bits);
	}

	uint8_t length_encoded[] = { 0x0, 0x3, 0x5, 0x6, 0x9, 0xA, 0xC, 0xF };
	unsigned int length_idx = (stuffing_bits + payload_length - 8) / 32;
	unsigned int length_enc = length_encoded[length_idx];

	unsigned int num_tail_bits = 0; // A2 mode
	if (mode == ArgosMode::ARGOS_3) {
		uint8_t tail_bits[] = { 7, 8, 9, 7, 8, 9, 7, 8 };
		num_tail_bits = tail_bits[length_idx];
	}
	unsigned int op_offset = 24;  // Keep first 24 bits spare for length field
	unsigned int ip_offset = 0;

	// Transmission is:
	// MSG_LEN (4)
	// ARGOSID (28)
	// USER_PAYLOAD (n*32 - 8)
	// STUFFING_BITS
	// TAIL_BITS (7,8,9)
	total_bits = 4 + 28 + payload_length + stuffing_bits + num_tail_bits;

	// Assign the buffer to include 24-bit length indicator and rounded-up to 3 bytes for XMEM alignment
	packet.assign(((((total_bits + 24) + 23) / 24) * 24) / 8, 0);

	// Set header
	PACK_BITS(length_enc, packet, op_offset, 4);
	PACK_BITS(argos_id, packet, op_offset, 28);

	// Append user payload
	unsigned int payload_bits_remaining = payload_length;
	uint8_t byte;
	while (payload_bits_remaining) {
		unsigned int bits = std::min(8U, payload_bits_remaining);
		payload_bits_remaining -= bits;
		EXTRACT_BITS(byte, user_payload, ip_offset, bits);
		PACK_BITS(byte, packet, op_offset, bits);
	}

	// Add any stuffing bits
	payload_bits_remaining = stuffing_bits;
	while (payload_bits_remaining) {
		unsigned int bits = std::min(8U, payload_bits_remaining);
		payload_bits_remaining -= bits;
		PACK_BITS(0, packet, op_offset, bits);
	}

	// Add tail bits
	PACK_BITS(0, packet, op_offset, num_tail_bits);

	// Setup TX mode
	uint8_t cmd = (mode == ArgosMode::ARGOS_3) ? ARTIC_CMD_SET_PTT_A3_TX_MODE : ARTIC_CMD_SET_PTT_A2_TX_MODE;

	// Send asynchronous command to enable TX mode and start packet transfer
	send_command_check_clean_async(cmd, INTERRUPT_1, (1<<MCU_COMMAND_ACCEPTED), SAT_ARTIC_DELAY_INTERRUPT_MS,
		[this, total_bits, num_tail_bits, packet]() {

		// Set 24-bit total length field (required at the head of the packet data)
		uint8_t *buffer = (uint8_t *)packet.data();
		buffer[0] = total_bits >> 16;
		buffer[1] = total_bits >> 8;
		buffer[2] = total_bits;
	    burst_access(XMEM, TX_PAYLOAD_ADDRESS, (const uint8_t *)buffer, nullptr, packet.length(), false);

	    // Set TCXO warm up
		set_tcxo_warmup_time(m_is_first_tx ? DEFAULT_TCXO_WARMUP_TIME_SECONDS : 0);

		get_and_print_status();

		DEBUG_TRACE("ArticTransceiver::send_packet: data[%u]=%s tail=%u",
				total_bits, Binascii::hexlify(packet).c_str(),
				num_tail_bits);

		// Send to ARTIC the command for sending only one packet and wait for the response TX_FINISHED
		send_command_check_clean_async(ARTIC_CMD_START_TX_1M_SLEEP, INTERRUPT_1, (1<<TX_FINISHED), SAT_ARTIC_TIMEOUT_SEND_TX_MS,
			[this]() {
			m_is_first_tx = false;
			m_notification_callback(ArgosAsyncEvent::TX_DONE);
		});
	});
}


void ArticTransceiver::send_ack(const unsigned int argos_id, const unsigned int a_dcs, const unsigned int dl_msg_id, const unsigned int exec_report, const ArgosMode mode)
{
	ArgosPacket packet, crc_packet;
	unsigned int stuffing_bits = 0;
	unsigned int payload_length = 96;
	unsigned int length_enc = 0x5;
	unsigned int service_id = 0x00EBA;
	unsigned int total_bits;

	DEBUG_TRACE("ArticTransceiver::send_ack");

	unsigned int num_tail_bits = 0; // A2 mode
	if (mode == ArgosMode::ARGOS_3)
		num_tail_bits = 7;

	// Transmission is:
	// LENGTH (24)
	// MSG_LEN (4)
	// SERVICEID (20)  + *
	// FCS (16)        |
	// ADCS (4)        | *
	// PMTID (28)      | *
	// DLMSGID (16)    | *
	// EXECRPT(4)      | *
	// DATA (28)       + *
	// STUFFING (0)
	// TAIL_BITS (7)
	total_bits = 24 + 4 + 20 + payload_length + stuffing_bits + num_tail_bits;

	unsigned int crc_offset = 0;
	unsigned int op_offset = 0;

	// Assign a temporary buffer for computing the FCS over the required* fields
	crc_packet.assign(13, 0); // 13 bytes, 100 bits
	PACK_BITS(service_id, crc_packet, crc_offset, 20);
	PACK_BITS(a_dcs, crc_packet, crc_offset, 4);
	PACK_BITS(argos_id, crc_packet, crc_offset, 28);
	PACK_BITS(dl_msg_id, crc_packet, crc_offset, 16);
	PACK_BITS(exec_report, crc_packet, crc_offset, 4);
	PACK_BITS(0, crc_packet, crc_offset, 28);

	// Compute FCS
	uint16_t fcs = CRC16::checksum(crc_packet, 100);

	// Assign the buffer rounded-up to 3 bytes for XMEM alignment
	packet.assign((((total_bits + 23) / 24) * 24) / 8, 0);

	PACK_BITS(total_bits, packet, op_offset, 24);
	PACK_BITS(length_enc, packet, op_offset, 4);
	PACK_BITS(service_id, packet, op_offset, 20);
	PACK_BITS(fcs, packet, op_offset, 16);
	PACK_BITS(a_dcs, packet, op_offset, 4);
	PACK_BITS(argos_id, packet, op_offset, 28);
	PACK_BITS(dl_msg_id, packet, op_offset, 16);
	PACK_BITS(exec_report, packet, op_offset, 4);
	PACK_BITS(0, packet, op_offset, 28);
	PACK_BITS(0, packet, op_offset, stuffing_bits);
	PACK_BITS(0, packet, op_offset, num_tail_bits);

	// Setup TX mode
	uint8_t cmd = (mode == ArgosMode::ARGOS_3) ? ARTIC_CMD_SET_PTT_A3_TX_MODE : ARTIC_CMD_SET_PTT_A2_TX_MODE;
	send_command_check_clean(cmd, INTERRUPT_1, (1<<MCU_COMMAND_ACCEPTED), SAT_ARTIC_DELAY_INTERRUPT_MS);

	// Set 24-bit total length field (required at the head of the packet data)
	burst_access(XMEM, TX_PAYLOAD_ADDRESS, (const uint8_t *)packet.data(), nullptr, packet.length(), false);

    // Set TCXO warm up
	set_tcxo_warmup_time(m_is_first_tx ? DEFAULT_TCXO_WARMUP_TIME_SECONDS : 0);

